<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $permissions = [
            'العملاء',
            'اضافة العملاء',
            'تعديل العملاء',
            'حذف العملاء',

            'ضرائب',
            'اضافة ضرائب',
            'تعديل ضرائب',
            'حذف ضرائب',

            'الفئات',
            'اضافة الفئات',
            'تعديل الفئات',
            'حذف الفئات',

            'المنتجات',
            'اضافة المنتجات',
            'عرض تفاصيل المنتجات',
            'تعديل المنتجات',
            'حذف المنتجات',

            'الفواتير',
            'اضافة الفواتير',
            'تعديل الفواتير',
            'عرض تفاصيل الفواتير',
            'تصدير الفواتير pdf',
            'تغير حالة الفواتير',
            'الحالات الخاصة للفواتير',
            'دفع الفواتير',
            'تحميل وطباعة الفواتير',
            'ارشفة الفواتير',
            'حذف الفواتير',
            'مرفقات الفاتورة',
            'اضافة مرفقات',
            'تحميل مرفقات',
            'حذف مرفقات',


            'ارشيف الفواتير',
            'الغاء ارشيف الفواتير',
            'حذف الفواتير نهائياً',

            'حالات الفواتير',
            'الحالات',
            'جميع الحالات',
            'تصدير الحالات pdf',

            'المدفوعات',
            'جميع المدفوعات',
            'تصدير المدفوعات pdf',
            'المدفوعات الخاصة',
            'تعديل المدفوعات',
            'حذف المدفوعات',
            'طباعة المدفوعات',

            'الصلاحيات والادوار',
            'المستخدمين',
            'اضافة المستخدمين',
            'تعديل المستخدمين',
            'عرض المستخدمين',
            'حذف المستخدمين',

            'الادوار',
            'اضافة الادوار',
            'تعديل الادوار',
            'عرض الادوار',
            'حذف الادوار',

            'الاعدادت',
            'الاشعارات',


        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
